backend/tests/load/artillery/ws-concurrency.yml
# Artillery WebSocket concurrency test: ~100 VU
#
# Tests: Connection management, room join/leave, message broadcast
#
# Usage:
#   cd backend && pnpm load:concurrency      (默认测试环境 localhost:3002)

config:
  target: 'http://localhost:3002'
  phases:
    - duration: 10
      arrivalRate: 5
      name: 'Ramp up'
    - duration: 30
      arrivalRate: 20
      name: 'Sustained load'

  socketio:
    transports: ['websocket']

  engines:
    socketio-v3: {}

  processor: './socketio-processor.cjs'

scenarios:
  - name: 'Room connection lifecycle'
    engine: socketio-v3
    weight: 1

    flow:
      # 1. Generate unique username
      - function: 'uniqueUsername'

      # 2. Register + Login (via processor)
      - function: 'registerAndLogin'

      # 3. Set socket auth params
      - function: 'setSocketAuth'

      # 4. Connect to Socket.IO (auth resolved at runtime)
      - connect:
          namespace: '/'
          auth:
            token: '{{ token }}'

      # 5. Join room
      - emit:
          channel: 'auction:join'
          data:
            roomId: 1

      # 6. Hold connection (simulate browsing)
      - think: 5

      # 7. Leave room
      - emit:
          channel: 'auction:leave'
          data:
            roomId: 1